import json

from src.services import investment_bank

data_test = [
            {"Дата операции": "01-01-2023", "Сумма операции": 100, "Категория": "Продукты"},
            {"Дата операции": "05-01-2023", "Сумма операции": 150, "Категория": "Ресторан"},
            {"Дата операции": "10-01-2023", "Сумма операции": 200, "Категория": "Одежда"},
            {"Дата операции": "15-01-2023", "Сумма операции": 300, "Категория": "Продукты"},
            {"Дата операции": "02-01-2023", "Сумма операции": 250, "Категория": "Ресторан"},
            {"Дата операции": "25-01-2023", "Сумма операции": 120, "Категория": "Продукты"},
            {"Дата операции": "30-01-2023", "Сумма операции": 180, "Категория": "Ресторан"}
        ]

month = "2023-01"

def test_services():
    result = investment_bank(month,data_test, 10)
    expect = '{"Инвесткопилка": 0}'
    assert result == expect