import json
import unittest
from unittest.mock import Mock, patch

import pytest
import self
from pandas import DataFrame

from src.views import hello_user, open_xlsx, list_card, summ, sort_date_operations, currency_rate


def test_hello():
    assert hello_user() in ['Доброй ночи!', "Доброе утро!", "Добрый день!", "Доброго вечера!"]



def tests_open_xlsx():
    test_file_name = './tests/test.xlsx'

    df = open_xlsx(test_file_name)

    assert df == [{'Дата операции': '31.12.2021 16:44:00', 'Дата платежа': '31.12.2021',
                   'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': -160.89,
                   'Валюта операции': 'RUB', 'Сумма платежа': -160.89, 'Валюта платежа': 'RUB',
                   'Кэшбэк': 0, 'Категория': 'Супермаркеты', 'MCC': 5411, 'Описание': 'Колхоз',
                   'Бонусы (включая кэшбэк)': 3, 'Округление на инвесткопилку': 0,
                   'Сумма операции с округлением': 160.89},
                  {'Дата операции': '31.12.2021 16:42:04', 'Дата платежа': '31.12.2021',
                   'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': -64.0,
                   'Валюта операции': 'RUB', 'Сумма платежа': -64.0, 'Валюта платежа': 'RUB',
                   'Кэшбэк': 0, 'Категория': 'Супермаркеты', 'MCC': 5411, 'Описание': 'Колхоз',
                   'Бонусы (включая кэшбэк)': 1, 'Округление на инвесткопилку': 0,
                   'Сумма операции с округлением': 64.0}
                  ]

def tests_list_card():
    operations = [{'Дата операции': '31.12.2021 16:44:00', 'Дата платежа': '31.12.2021',
                   'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': -160.89,
                   'Валюта операции': 'RUB', 'Сумма платежа': -160.89, 'Валюта платежа': 'RUB',
                   'Кэшбэк': 0, 'Категория': 'Супермаркеты', 'MCC': 5411, 'Описание': 'Колхоз',
                   'Бонусы (включая кэшбэк)': 3, 'Округление на инвесткопилку': 0,
                   'Сумма операции с округлением': 160.89},
                  {'Дата операции': '31.12.2021 16:42:04', 'Дата платежа': '31.12.2021',
                   'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': -64.0,
                   'Валюта операции': 'RUB', 'Сумма платежа': -64.0, 'Валюта платежа': 'RUB',
                   'Кэшбэк': 0, 'Категория': 'Супермаркеты', 'MCC': 5411, 'Описание': 'Колхоз',
                   'Бонусы (включая кэшбэк)': 1, 'Округление на инвесткопилку': 0,
                   'Сумма операции с округлением': 64.0}
                  ]

    expected = ['*7197']

    result = list_card(operations)
    assert result == expected

def test_summ():
    operations = [{'Дата операции': '31.12.2021 16:44:00', 'Дата платежа': '31.12.2021',
                   'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': -160.89,
                   'Валюта операции': 'RUB', 'Сумма платежа': -160.89, 'Валюта платежа': 'RUB',
                   'Кэшбэк': 0, 'Категория': 'Супермаркеты', 'MCC': 5411, 'Описание': 'Колхоз',
                   'Бонусы (включая кэшбэк)': 3, 'Округление на инвесткопилку': 0,
                   'Сумма операции с округлением': 160.89},
                  {'Дата операции': '31.12.2021 16:42:04', 'Дата платежа': '31.12.2021',
                   'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': -64.0,
                   'Валюта операции': 'RUB', 'Сумма платежа': -64.0, 'Валюта платежа': 'RUB',
                   'Кэшбэк': 0, 'Категория': 'Супермаркеты', 'MCC': 5411, 'Описание': 'Колхоз',
                   'Бонусы (включая кэшбэк)': 1, 'Округление на инвесткопилку': 0,
                   'Сумма операции с округлением': 64.0}
                  ]
    list_card = ['*7197']

    expect = [{
            "last_digits": '7197',
            "total_spent": -224.89,
            "cashback": 0,
        }]
    result = summ(operations, list_card)
    assert result == expect

data_test = [{"Дата операции": "2023-05-05", "Сумма операции": 100, "Категория": "Продукты"},
             {"Дата операции": "2023-06-15", "Сумма операции": 150, "Категория": "Ресторан"},
             {"Дата операции": "2023-05-10", "Сумма операции": 200, "Категория": "Одежда"},
             {"Дата операции": "2023-05-11", "Сумма операции": 300, "Категория": "Продукты"},
             {"Дата операции": "2023-05-20", "Сумма операции": 250, "Категория": "Ресторан"},
             {"Дата операции": "2023-01-15", "Сумма операции": 120, "Категория": "Продукты"},
             {"Дата операции": "2023-01-20", "Сумма операции": 180, "Категория": "Ресторан"}
             ]
def test_sort_date_operations():
    result = sort_date_operations(data_test, '2023-01-30 00:00:00')
    expect = [{"Дата операции": "20-01-2023 00:00:00", "Сумма операции": 180, "Категория": "Ресторан"},
              {"Дата операции": "15-01-2023 00:00:00", "Сумма операции": 120, "Категория": "Продукты"}
              ]
    assert result == expect
